# -*- org-emphasis-alist: nil -*-

#+TITLE: Pathfinder Character Sheet
#+AUTHOR: Lucas Meyers (Adapted from Jesus Ramos)

* Basic Character Info
  - Name :: Luronk (Walter)
  - Race :: Half-org
  - Gender :: Male
  - Height :: 6'4"
  - Weight :: 276
  - Age :: 20
  - Alignment :: Chaotic Nuetral
  - Deity :: Theras
  - Background Occupation :: Rickshaw
  - Languages :: Common, Orcish

  #+NAME:Size
  |------------|
  | Size Bonus |
  |------------|
  |          0 |
  |------------|

* Character Stats
  #+NAME:Stats
  |---+--------------+-------+----------+------+----------+---------+------|
  | ! | Stat         | Total | Modifier | Base | Inherent | Enhance | Misc |
  |---+--------------+-------+----------+------+----------+---------+------|
  | # | Strength     | 19    | 4        |   19 |          |         |      |
  | # | Dexterity    | 14    | 2        |   14 |          |         |      |
  | # | Constitution | 20    | 5        |   18 |          |       2 |      |
  | # | Intelligence | 7     | -2       |    7 |          |         |      |
  | # | Wisdom       | 10    | 0        |   10 |          |         |      |
  | # | Charisma     | 7     | -2       |    7 |          |         |      |
  |---+--------------+-------+----------+------+----------+---------+------|
  #+TBLFM: $3=vsum($5..$8)::$4=floor(($3 - 10) / 2)

  #+NAME:Initiative
  |---+------------+-------+------+------|
  | ! |            | Total | Base | Misc |
  |---+------------+-------+------+------|
  | # | Initiative |     3 |    2 |    1 |
  |---+------------+-------+------+------|
  #+TBLFM: @2$3=vsum(@2$4..@2$5)::@2$4=remote(Stats, @3$Modifier)

* Class
  #+NAME:Class
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  | ! |     HP | HD  | Class Name    | BAB | Skills | Fort | Ref | Will | Levels |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  |   |    127 | d12 | Barbarian     |   8 |      4 |    6 |   2 |    2 |      8 |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  |   | Totals |     | Favored Class |     |        |      |     |      |        |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  | # |    127 |     | Witch         |   8 |      4 |    6 |   2 |    2 |      8 |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  #+TBLFM: @>$2=vsum(@2..@-2)::@>$5..@>$10=vsum(@2..@-2)

  #+NAME:Experience
  |------------+-------+-------|
  | Experience | 51672 | 75000 |
  |------------+-------+-------|

  #+NAME:Feats
  |----------------------+-------------|
  | Name                 | Description |
  |----------------------+-------------|
  | Power Attack         |             |
  | Cleave               |             |
  | Intimidating Prowess |             |
  | Raging Vitality      |             |
  |----------------------+-------------|

  #+NAME:Features
  |--------------+-------------|
  | Name         | Description |
  |--------------+-------------|
  | Dark Vision  |             |
  | Intimidating |             |
  | Orc Blood    |             |
  | Orc Ferocity |             |
  | Weapon Fam.  |             |
  |--------------+-------------|

  #+NAME:ClassFeatures
  |------------------------+-------------|
  | Name                   | Description |
  |------------------------+-------------|
  | Rage                   |             |
  | Rage Powers            |             |
  | Trap Sense             |             |
  | Improved Uncanny Dodge |             |
  | Damage Reduction       |             |
  |------------------------+-------------|

* Defense
  #+NAME:Saves
  |---+---------------+-------+------+---------+---------+------|
  | ! | Saving Throws | Total | Base | Ability | Enhance | Misc |
  |---+---------------+-------+------+---------+---------+------|
  | # | Fortitude     |    12 |    6 |       5 |         |    1 |
  | # | Reflex        |     5 |    2 |       2 |         |    1 |
  | # | Will          |     3 |    2 |       0 |         |    1 |
  |---+---------------+-------+------+---------+---------+------|
  #+TBLFM: $5=remote(Stats,@3$Modifier)::@2$3..@4$3=vsum($4..$7)::@2$4=remote(Class, @>$Fort)::@2$5=remote(Stats, @4$Modifier)::@3$4=remote(Class, @>$Ref)::@4$4=remote(Class, @>$Will)::@4$5=remote(Stats, @6$Modifier)

  #+NAME:HP
  |---+--------------+-----|
  | # | Base         | 127 |
  |   | Temporary HP |     |
  |---+--------------+-----|
  | # | Total        | 127 |
  |---+--------------+-----|
  #+TBLFM: @1$3=remote(Class, @2$HP)::@3$3=@1$3+@2$3

  #+NAME:AC
  |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
  | ! | Type      | Total | Base | Armor | Shield | Dex | Size | Dodge | Natural | Deflect | Misc |
  |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
  | # | AC        |    20 |   10 |     5 | 0      |   2 |    0 |       |       2 |       1 |      |
  | # | Touch     |    13 |   10 |   N/A | N/A    |   2 |    0 |       |     N/A |       1 |      |
  | # | Flat-foot |    18 |   10 |     5 | N/A    | N/A |    0 | N/A   |       2 |       1 |      |
  |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
  #+TBLFM: @2$3..@>$3=vsum($4..$12);N::@2$5=remote(Armor, @2$AC)::@2$6=0::@2$7..@3$7=min(remote(Stats, @3$Modifier), remote(Armor, @>$6)::@2$8..@>$8=remote(Size, @2$1)::@4$5=remote(Armor, @2$AC)

  #+NAME:CMD
  |---+-----+-------+------+-----+-----+-----+------+------|
  | ! |     | Total | Base | BAB | Dex | Str | Size | Misc |
  |---+-----+-------+------+-----+-----+-----+------+------|
  | # | CMD |    24 |   10 |   8 |   2 |   4 |    0 |      |
  |---+-----+-------+------+-----+-----+-----+------+------|
  #+TBLFM: @2$3=vsum($4..$9)::@2$5=remote(Class, @>$BAB)::@2$6=remote(Stats, @3$Modifier)::@2$7=remote(Stats, @2$Modifier)::@2$8=remote(Size, @2$1)

  #+NAME:Resistances
  |------------------+---|
  | Damage Reduction | 1 |
  | Spell Resistance |   |
  |------------------+---|

* Attacks
  #+NAME:Attacks
  |---+--------+-------+-------------------+---------+------+------|
  | ! |        | Total | Base Attack Bonus | Ability | Size | Misc |
  |---+--------+-------+-------------------+---------+------+------|
  | # | Melee  |    12 |                 8 |       4 |    0 |      |
  | # | Ranged |    10 |                 8 |       2 |    0 |      |
  | # | CMB    |    12 |                 8 |       4 |    0 |      |
  |---+--------+-------+-------------------+---------+------+------|
  #+TBLFM: @2$3..@4$3=vsum($4..$7)::@2$4..@4$4=remote(Class, @>$BAB)::@2$5=remote(Stats, @2$Modifier)::@2$6=remote(Size, @2$1)::@3$5=remote(Stats, @3$Modifier)::@3$6=remote(Size, @2$1)::@4$5=remote(Stats, @2$Modifier)::@4$6=remote(Size, @2$1)

  #+NAME:Weapons
  |---+----------------+---------+------------------+--------+------+-------+------+------+--------|
  | ! | Weapon         | Enhance | Attack Modifiers | Damage | Crit | Range | Size | Type | Notes  |
  |---+----------------+---------+------------------+--------+------+-------+------+------+--------|
  |   | Cruel Greataxe |         |                  |   1d12 | x3   |    20 | M    | S    |        |
  |   | Dagger         |         |                  |    1d4 | x2   | 19-20 | M    |      |        |
  |   | Sword Cane     |         |                  |    1d6 | x2   |    20 | M    |      | Exotic |
  |   | Greatsword     | 1       |                  |    2d6 | x2   | 19-20 | M    |      |        |
  |---+----------------+---------+------------------+--------+------+-------+------+------+--------|

* Skills
  # To mark as a class skill just put a 1 in the class column, org mode doesn't
  # support checkboxes in tables yet. You can add or change the ability the
  # stat depends on by modifying the Stat column. If a skill is affected by
  # armor penalty just mark it with a 1 in the Armor Penalty column
  #+NAME:Skills
  |---+----+----+-------+----------------------+------+--------+-------+---------+---------+------|
  | ! | TR | AP | Class | Skill                | Stat |  Total | Ranks | Ability | Trained | Misc |
  |---+----+----+-------+----------------------+------+--------+-------+---------+---------+------|
  | # |    |  1 |     1 | Acrobatics           | Dex  |      7 |     2 |       2 |       3 |      |
  | # |    |    |       | Appraise             | Int  |     -2 |       |      -2 |         |      |
  | # |    |    |       | Bluff                | Cha  |     -2 |       |      -2 |         |      |
  | # |    |  1 |     1 | Climb                | Str  |     10 |     1 |       4 |       3 |    2 |
  | # |    |    |     1 | Craft:               | Int  |     -2 |       |      -2 |         |      |
  | # |    |    |       | Diplomacy            | Cha  |     -2 |       |      -2 |         |      |
  | # |  1 |  1 |       | Disable Device       | Dex  |      - |       |       2 |         |      |
  | # |    |    |       | Disguise             | Cha  |     -2 |       |      -2 |         |      |
  | # |    |  1 |       | Escape Artist        | Dex  |      2 |       |       2 |         |      |
  | # |    |  1 |       | Fly                  | Dex  |      2 |       |       2 |         |      |
  | # |  1 |    |     1 | Handle Animal        | Cha  |      2 |     1 |      -2 |       3 |      |
  | # |    |    |       | Heal                 | Wis  |      0 |       |       0 |         |      |
  | # |    |    |     1 | Intimidate           | Cha  |     15 |     8 |      -2 |       3 |    6 |
  | # |  1 |    |       | Knowledge: Arcana    | Int  |      - |       |      -2 |         |      |
  | # |  1 |    |       | Knowledge: Dungeon   | Int  |      - |       |      -2 |         |      |
  | # |  1 |    |       | Knowledge: Engineer  | Int  |      - |       |      -2 |         |      |
  | # |  1 |    |       | Knowledge: Geography | Int  |      - |       |      -2 |         |      |
  | # |  1 |    |       | Knowledge: History   | Int  |      - |       |      -2 |         |      |
  | # |  1 |    |       | Knowledge: Local     | Int  |      - |       |      -2 |         |      |
  | # |  1 |    |     1 | Knowledge: Nature    | Int  |      2 |     1 |      -2 |       3 |      |
  | # |  1 |    |       | Knowledge: Nobility  | Int  |      - |       |      -2 |         |      |
  | # |  1 |    |       | Knowledge: Planes    | Int  |      - |       |      -2 |         |      |
  | # |  1 |    |       | Knowledge: Religion  | Int  |      - |       |      -2 |         |      |
  | # |  1 |    |       | Linguistics          | Int  |      - |       |      -2 |         |      |
  | # |    |    |     1 | Perception           | Wis  |      8 |     5 |       0 |       3 |      |
  | # |    |    |       | Perform:             | Cha  |     -2 |       |      -2 |         |      |
  | # |  1 |    |       | Profession:          | Wis  |      - |       |       0 |         |      |
  | # |    |  1 |     1 | Ride                 | Dex  |      6 |     1 |       2 |       3 |      |
  | # |    |    |       | Sense Motive         | Wis  |      0 |       |       0 |         |      |
  | # |  1 |  1 |       | Sleight of Hand      | Dex  |      - |       |       2 |         |      |
  | # |  1 |    |       | Spellcraft           | Int  |      - |       |      -2 |         |      |
  | # |    |  1 |       | Stealth              | Dex  |      2 |       |       2 |         |      |
  | # |    |    |     1 | Survival             | Wis  |      4 |     1 |       0 |       3 |      |
  | # |    |  1 |     1 | Swim                 | Str  |      8 |     1 |       4 |       3 |      |
  | # |  1 |    |       | Use Magic Device     | Cha  |      - |       |      -2 |         |      |
  |---+----+----+-------+----------------------+------+--------+-------+---------+---------+------|
  | # |    |    |       |                      |      | Total: |    21 |         |         |      |
  |---+----+----+-------+----------------------+------+--------+-------+---------+---------+------|
  #+TBLFM:@2$7..@-1$7=if(($2 > 0 && $8 > 0) || ($2 == 0), vsum($8..$11)+($3*remote(Armor, @>$Penalty)), string("-"))::@2$9..@-1$9='(cond ((string= $6 "Str") remote(Stats, @2$Modifier)) ((string= $6 "Dex") remote(Stats, @3$Modifier)) ((string= $6 "Int") remote(Stats, @5$Modifier)) ((string= $6 "Wis") remote(Stats, @6$Modifier)) ((string= $6 "Cha") remote(Stats, @7$Modifier)))::@2$10..@-1$10=if($4 > 0 && $8 > 0, 3, string(""))::@>$8=vsum(@2$8..@-1$8)
  
* Inventory

** Equipment
   # Just add new rows for new items
   #+NAME:Equipment
   |---+-------------------------------------+-----------+------------------+---------------|
   | ! | Name                                |  Quantity | Effective Weight | Actual Weight |
   |---+-------------------------------------+-----------+------------------+---------------|
   |   | Mist Mail                           |         1 |               25 |            25 |
   |   | Ring of Prot(1)                     |         1 |                  |               |
   |   | Belt of Bear's Endurance            |         1 |                1 |             1 |
   |   | Cloak of Resistance(1)              |         1 |                1 |             1 |
   |   | Amulet of Nat Armor(2)              |         1 |                  |               |
   |   | Backpack                            |         1 |                2 |             2 |
   |   | Bucket                              |         2 |                4 |               |
   |   | Traveler's Anytool                  |         1 |                2 |               |
   |   | Fishing Net                         | 25(sq ft) |                5 |               |
   |   | Flint and Steel                     |         1 |                  |               |
   |   | Bloodvine Rope                      |     100ft |               10 |               |
   |   | Handy Haversack                     |         1 |                5 |             5 |
   |   | Angry Amulet                        |         1 |                  |               |
   |   | Quick Runners Shirt                 |         1 |                  |               |
   |   | Featherstep Slippers                |         1 |                  |               |
   |   | Magic Whisk                         |         1 |                  |               |
   |   | Waterskin                           |         1 |                4 |               |
   |   | Pillow                              |         1 |                  |               |
   |   | Climber's Kit                       |         1 |                5 |               |
   |   | Scholar's Outfit                    |         1 |                6 |             6 |
   |   | Magnifying Glass                    |         1 |                  |               |
   |   | Cracked Dusty Rose Prism Ioun Stone |         1 |                  |               |
   |   | Chain                               |      50ft |               10 |               |
   |   | Bell of Reason                      |         1 |                  |               |
   |   | Chalk                               |        10 |                  |               |
   |   | Blackwater Band                     |         1 |                  |               |
   |   | ID Card                             |         1 |                  |               |
   |   | Beret                               |         1 |                1 |             1 |
   |   | Blue Sleeve of Many Garments        |         1 |                1 |             1 |
   |   | Mask of the Father                  |         1 |                1 |             1 |
   |---+-------------------------------------+-----------+------------------+---------------|
   | # | Total Weight:                       |           |               81 |            41 |
   |---+-------------------------------------+-----------+------------------+---------------|
   #+TBLFM: @>$4=vsum(@2$4..@-2$4)::@>$5=vsum(@2$5..@-2$5)

   # Worn magic items
   #+NAME:WornEquipment
   |-----------+-----------------------------|
   | Head      |                             |
   | Face      |                             |
   | Throat    | Amulet of Natural Armor(2)  |
   | Shoulders | Cloak of Resistance (1)     |
   | Body      | Mistmail                    |
   | Torso     | Quick Runners Shirt         |
   | Arms      |                             |
   | Hands     |                             |
   | Ring      | Ring of Protection (1)      |
   | Ring      |                             |
   | Waist     | Belt of Bear's Endurance(2) |
   | Feet      | Featherstep Slippers        |
   |-----------+-----------------------------|

   #+NAME:Armor
   |---+---------+---------------+---------+----+---------+---------+----------------+-------+------+----------|
   | ! | Type    | Name          | Enhance | AC | Max Dex | Penalty | Spell Fail (%) | Type  | Size | Material |
   |---+---------+---------------+---------+----+---------+---------+----------------+-------+------+----------|
   |   | Armor   | Mistmail      |         |  5 |       6 |       1 |                | Light | M    |          |
   |   | Ring    | Ring of Prot  |         |  1 |         |         |                |       |      |          |
   |   | Amulet  | Amulet of Nat |         |  2 |         |         |                |       |      |          |
   |---+---------+---------------+---------+----+---------+---------+----------------+-------+------+----------|
   | # | Totals: |               |         | 18 |       6 |       1 |              0 |       |      |          |
   |---+---------+---------------+---------+----+---------+---------+----------------+-------+------+----------|
   #+TBLFM: @>$5=10+vsum(@2$5..@-1$5)::@>$6=@2$6::@>$7=vsum(@2$7..@-1$7)::@>$8=vsum(@2$8..@-1$8)

** Wealth
   #+NAME:Wealth
   |----------+-------|
   | Platinum |       |
   | Gold     | 10644 |
   | Silver   |     8 |
   | Copper   |       |
   |----------+-------|

** Bags and Containers
   #+NAME:Bags
   |-----------------+--------+--------|
   | Container       | Volume | Weight |
   |-----------------+--------+--------|
   | Handy Haversack | 12     | 120    |
   |-----------------+--------+--------|

** Special Abilities
   #+NAME:SpecialAbilities
   |--------------------+--------+--------------------------------------------------|
   | Name               | Uses   | Details                                          |
   |--------------------+--------+--------------------------------------------------|
   | Rage               | 23 rds | +4str,+6con                                      |
   | Intimidating Glare | -      | Intimidate,shaken for 1d4+excess/5               |
   | Knockdown          | 1 rage | Make trip, no attack oppurtunity, deal str dmg   |
   | Ground Breaker     | 1 rage | Difficult terrain around, dc15 go prone          |
   | Terrifying Howl    | -      | Shaken->Panicked for 1d4+1rds DC:10+lvl/2+strmod |
   |--------------------+--------+--------------------------------------------------|

